<template>
    <div>
    <app-header />
    <big-blue-bar>
      <ilo-dialog title="Cогласие на обработку персональных данных.">
        <p>
          В соответствии с ч.1 ст.9 Федерального закона от 27.07.2006 №152-ФЗ
          «О персональных данных» даю согласие на обработку приложению IloIlo,
          далее Оператор, моих персональных данных, указанных в настоящей форме
          в целях оказания услуг, предоставляемых Оператором и проведения маркетинговых
          акций (в т.ч. осуществления информационных рассылок о маркетинговых мероприятиях,
          специальных предложениях и акциях посредством SMS и e-mail).
          Оператор вправе осуществлять сбор, запись, систематизацию, накопление,
          хранение, уточнение (обновление, изменение), извлечение, использование,
          передачу (предоставление, доступ), обезличивание, блокирование, удаление, уничтожение
          персональных данных с использованием и без использования средств автоматизации.
          По поручению Оператора персональные данные могут быть обработаны компаниями-партнерами,
          список которых приведен в Политике об обработке персональных данных, размещенной на
          официальном сайте Оператора.
        </p>
        <p>
          Настоящее согласие действует с даты подписания/регистрации до его письменного отзыва.
        </p>
      </ilo-dialog>
    </big-blue-bar>
  </div>
</template>

<script>
import AppHeader from '../components/AppHeader.vue';
import IloDialog from '../components/Dialog.vue';
import BigBlueBar from '../components/BigBlueBar.vue';

export default {
  name: 'About',
  components: {
    AppHeader,
    IloDialog,
    BigBlueBar,
  },
};
</script>

<style lang="scss" scoped>

</style>
